In [3]:
import pandas as pd

In [10]:
# Exercise 1 From the given dataset print the first and last five rows

In [14]:
raw_file_url = ("./Automobile_data.csv")

In [67]:

df = pd.read_csv(raw_file_url)
print("First 5 rows")
display(df.head())
print("Last 5 rows")
display(df.tail())

First 5 rows

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

Last 5 rows

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
56,81,volkswagen,sedan,97.3,171.7,ohc,four,85,27,7975.0
57,82,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
58,86,volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0
59,87,volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0
60,88,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0

In [21]:
# Exercise 2 Clean the dataset and update the CSV file

In [77]:
df.to_csv("raw_file_url")
df = df.replace(["?", "n.a", "NaN"], pd.NA)
print(df)
df.to_csv("cleaned_data.csv", index=False)

    index      company   body-style  wheel-base  length engine-type  \
0       0  alfa-romero  convertible        88.6   168.8        dohc
1       1  alfa-romero  convertible        88.6   168.8        dohc
2       2  alfa-romero    hatchback        94.5   171.2        ohcv
3       3         audi        sedan        99.8   176.6         ohc
4       4         audi        sedan        99.4   176.6         ohc
..    ...          ...          ...         ...     ...         ...
56     81   volkswagen        sedan        97.3   171.7         ohc
57     82   volkswagen        sedan        97.3   171.7         ohc
58     86   volkswagen        sedan        97.3   171.7         ohc
59     87        volvo        sedan       104.3   188.8         ohc
60     88        volvo        wagon       104.3   188.8         ohc

   num-of-cylinders  horsepower  average-mileage    price
0              four         111               21  13495.0
1              four         111               21  16500.0
2               six         154               19  16500.0
3              four         102               24  13950.0
4              five         115               18  17450.0
..              ...         ...              ...      ...
56             four          85               27   7975.0
57             four          52               37   7995.0
58             four         100               26   9995.0
59             four         114               23  12940.0
60             four         114               23  13415.0

[61 rows x 10 columns]

In [27]:
# Exercise 3  Find the most expensive car company name

In [38]:
most_expensive = df[df['price'] == df['price'].max()]
print("Exercise 3: Most Expensive Car")
display(most_expensive[['company', 'price']])

Exercise 3: Most Expensive Car

          company    price
35  mercedes-benz  45400.0

In [35]:
# Exercise 4: Print All Toyota Cars details

In [37]:
toyota_cars = df[df['company'] == 'toyota']
print("Exercise 4: All Toyota Cars")
display(toyota_cars)

Exercise 4: All Toyota Cars

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
48,66,toyota,hatchback,95.7,158.7,ohc,four,62,35,5348.0
49,67,toyota,hatchback,95.7,158.7,ohc,four,62,31,6338.0
50,68,toyota,hatchback,95.7,158.7,ohc,four,62,31,6488.0
51,69,toyota,wagon,95.7,169.7,ohc,four,62,31,6918.0
52,70,toyota,wagon,95.7,169.7,ohc,four,62,27,7898.0
53,71,toyota,wagon,95.7,169.7,ohc,four,62,27,8778.0
54,79,toyota,wagon,104.5,187.8,dohc,six,156,19,15750.0

In [40]:
# Exercise 5: Count total cars per company

In [60]:
car_counts = df['company'].value_counts()
print("Exercise 5: Total Cars per Company")
display(car_counts)

Exercise 5: Total Cars per Company

toyota           7
bmw              6
mazda            5
nissan           5
audi             4
mercedes-benz    4
mitsubishi       4
volkswagen       4
alfa-romero      3
chevrolet        3
honda            3
isuzu            3
jaguar           3
porsche          3
dodge            2
volvo            2
Name: company, dtype: int64

In [42]:
# Exercise 6: Find each company’s Higesht price car

In [59]:
highest_price_by_company = df.loc[df.groupby('company')['price'].idxmax()]
print("Exercise 6: Highest Price Car by Company")
display(highest_price_by_company[['company', 'price']])

Exercise 6: Highest Price Car by Company

          company    price
1     alfa-romero  16500.0
6            audi  18920.0
11            bmw  41315.0
15      chevrolet   6575.0
16          dodge   6377.0
19          honda  12945.0
21          isuzu   6785.0
26         jaguar  36000.0
31          mazda  18344.0
35  mercedes-benz  45400.0
39     mitsubishi   8189.0
44         nissan  13499.0
46        porsche  37028.0
54         toyota  15750.0
58     volkswagen   9995.0
60          volvo  13415.0

In [44]:
# Exercise 7: Find the average mileage of each car making company

In [58]:

mileageDf = df.groupby('company')['average-mileage'].mean()
mileageDf = mileageDf.reset_index()
display(mileageDf)

          company  average-mileage
0     alfa-romero        20.333333
1            audi        20.000000
2             bmw        19.000000
3       chevrolet        41.000000
4           dodge        31.000000
5           honda        26.333333
6           isuzu        33.333333
7          jaguar        14.333333
8           mazda        28.000000
9   mercedes-benz        18.000000
10     mitsubishi        29.500000
11         nissan        31.400000
12        porsche        17.000000
13         toyota        28.714286
14     volkswagen        31.750000
15          volvo        23.000000

In [51]:
# Exercise 8: Sort all cars by Price column

In [78]:
sorted_cars = df.sort_values(by='price')
print("Exercise 8: Cars Sorted by Price")
display(sorted_cars)

Exercise 8: Cars Sorted by Price

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
13,16,chevrolet,hatchback,88.4,141.1,l,three,48,47,5151.0
27,36,mazda,hatchback,93.1,159.1,ohc,four,68,30,5195.0
48,66,toyota,hatchback,95.7,158.7,ohc,four,62,35,5348.0
36,49,mitsubishi,hatchback,93.7,157.3,ohc,four,68,37,5389.0
28,37,mazda,hatchback,93.1,159.1,ohc,four,68,31,6095.0
...,...,...,...,...,...,...,...,...,...,...
11,14,bmw,sedan,103.5,193.8,ohc,six,182,16,41315.0
35,47,mercedes-benz,hardtop,112.0,199.2,ohcv,eight,184,14,45400.0
22,31,isuzu,sedan,94.5,155.9,ohc,four,70,38,NaN
23,32,isuzu,sedan,94.5,155.9,ohc,four,70,38,NaN
47,63,porsche,hatchback,98.4,175.7,dohcv,eight,288,17,NaN

In [79]:
# Exercise 9: Concatenate two data frames using the following conditions

In [80]:
GermanCars = {'Company': ['Ford', 'Mercedes', 'BMV', 'Audi'], 'Price': [23845, 171995, 135925, 71400]}
japaneseCars = {'Company': ['Toyota', 'Honda', 'Nissan', 'Mitsubishi'], 'Price': [29995, 23600, 61500, 58900]}

df_german = pd.DataFrame(GermanCars)
df_japanese = pd.DataFrame(japaneseCars)
concatenated_cars = pd.concat([df_german, df_japanese], keys=['German', 'Japanese'])
print("Exercise 9: Concatenated DataFrames with Keys")
print(concatenated_cars)

Exercise 9: Concatenated DataFrames with Keys
               Company   Price
German   0        Ford   23845
         1    Mercedes  171995
         2         BMV  135925
         3        Audi   71400
Japanese 0      Toyota   29995
         1       Honda   23600
         2      Nissan   61500
         3  Mitsubishi   58900

In [ ]:
# Exercise 10: Merge two data frames using the following condition

In [85]:

Car_Price = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'Price': [23845, 17995, 135925, 71400]}
df1 = pd.DataFrame(Car_Price)

car_Horsepower = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'horsepower': [141, 80, 182, 160]}
df2 = pd.DataFrame(car_Horsepower)

merged_df = pd.merge(df1, df2, on='Company')

print(merged_df)

  Company   Price  horsepower
0  Toyota   23845         141
1   Honda   17995          80
2     BMV  135925         182
3    Audi   71400         160